app/Controllers/usuario_controller.php

    public function guardar(){
        $input = $this->campo_validacion();
        $formModel = new usuario_Model();

        if(!$input){
            $data['titulo'] ='registrar_usuario';
            echo view('front/head_view',$data);
            echo view('front/navbar_view');
            echo view('back/usuario/registrar_usuario', ['validation' => $this->validator]);
            echo view('front/footer_view');
        }else{
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('MIGUEL', 'QUINTANA', 'miguel', '0000@gmail.com', '$2y$10$voblZN64yz9MLFdD5YBMFeJiL0oCUZrnKNUAmT/aavWfevqUz1546')

    public function verUsuarios() {
        $usuarioModel = new usuario_Model();
        $data['usuarios'] = $usuarioModel->findAll();
        $data['usuarios'] = $usuarioModel->where('id_bandera', 1)->findAll();
---
SELECT *
FROM `usuarios`
SELECT *
FROM `usuarios`
WHERE `id_bandera` = 1

    public function editarUsuario($id_usuario){
        // Consulta la base de datos para obtener los datos del usuario con el ID proporcionado
        $usuarioModel = new usuario_Model();
        $data['usuario'] = $usuarioModel->find($id_usuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '18'

    public function actualizar(){
        $input = $this->campo_validacion(true);

        if (!$input) {
            // Si la validación falla, vuelve al formulario de edición con los errores.
            return $this->editarUsuario($this->request->getVar('id_usuario'));
        } else {
            // Obten el ID del usuario a editar desde el formulario
            $id_usuario = $this->request->getVar('id_usuario');

            // Obtén los nuevos datos del formulario
            $nuevosDatos = [
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'email' => $this->request->getVar('email'),
                'usuario' => $this->request->getVar('usuario'),
            ];

            // Actualiza los datos del usuario en la base de datos
            $usuarioModel = new usuario_Model();
            $usuarioModel->update($id_usuario, $nuevosDatos);
---
UPDATE `usuarios` SET `nombre` = 'Maria Romina', `apellido` = 'Perez', `email` = 'maria@gmail.com', `usuario` = 'Maria'
WHERE `usuarios`.`id_usuario` IN ('18')